# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_key_vault_certificate.vpn: Reading...
data.azurerm_key_vault_certificate.vpn: Read complete after 0s [id=https://kvaltinnauth001hub.vault.azure.net/certificates/VPNRootCert/dc43a0f1e5e549cf845744cc5085f007]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_storage_blob.client_key_cert["havardandersen"] will be created
  + resource "azurerm_storage_blob" "client_key_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "havardandersen/havardandersenKey.pem"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (sensitive value)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.client_pem_cert["havardandersen"] will be created
  + resource "azurerm_storage_blob" "client_pem_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "havardandersen/havardandersenCert.pem"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (known after apply)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.client_pfx_cert["havardandersen"] will be created
  + resource "azurerm_storage_blob" "client_pfx_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "havardandersen/havardandersenCert.pfx"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (known after apply)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # pkcs12_from_pem.client_certs["havardandersen"] will be created
  + resource "pkcs12_from_pem" "client_certs" {
      + ca_pem           = (sensitive value)
      + cert_pem         = (sensitive value)
      + encoding         = "modern2023"
      + id               = (known after apply)
      + private_key_pem  = (sensitive value)
      + result           = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # tls_cert_request.client["havardandersen"] will be created
  + resource "tls_cert_request" "client" {
      + cert_request_pem = (known after apply)
      + dns_names        = [
          + "havardandersen",
        ]
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name = "havardandersen"
        }
    }

  # tls_locally_signed_cert.client["havardandersen"] will be created
  + resource "tls_locally_signed_cert" "client" {
      + allowed_uses          = [
          + "client_auth",
        ]
      + ca_cert_pem           = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC/zCCAeegAwIBAgIQaMXHc91jah2sDZEnPxGgwjANBgkqhkiG9w0BAQsFADAR
            MQ8wDQYDVQQDEwZWUE4gQ0EwHhcNMjUwMTEwMTgxODE4WhcNMzUwMTA4MTgxODE4
            WjARMQ8wDQYDVQQDEwZWUE4gQ0EwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK
            AoIBAQDDoOdFiBM6I+HVF9tPGg0ZpaIVnQHuPoSIhgGAxx7EXPzCQq8uTLuzJbD/
            +dCZnz+dpmXM+LT4qSwaQ++YpXGdspIy53z0p3JQt2qMU5uye4r9TlML2NETw6wm
            Dd0U6xgSRIuBwOIHPbm9ejrAf674n73iHhokmYmT75mYdT8ktydQw+L7R0MX23HL
            g3iQcWED3eZflj3X8Mqm8Z+UqEr2thkF2lJfiPeP/NKu7KOlWZHVrYPcVqVoSErL
            cvrCK/UKheOY7dGyt8f3PZp6CFXMDfo172l8pu39NZ/VGIXtNiSr03qLotzqaykB
            NkvM5uKp7uoPLykqjq72oYzBfrPhAgMBAAGjUzBRMA8GA1UdEwEB/wQFMAMBAf8w
            HQYDVR0OBBYEFB8OtSth0JBdv5yrXXLuRTFwRGDkMB8GA1UdIwQYMBaAFB8OtSth
            0JBdv5yrXXLuRTFwRGDkMA0GCSqGSIb3DQEBCwUAA4IBAQAfSym4y+4hlVtBeNdt
            Ja60PzkZZ4YZ/a3YvDABf3xdv5M2xf8kL3kR6I1Wdv4lX+gRudcu8A5ECk+VbLE7
            /X1gutr7URO2cKEwGnxfvy1lF5KdUU0ai9lfKw2yKJxdchhcmvUoYiMG0vrmHQHL
            622zBGGO6MXRc81s8k+4kSd1tYqgfkGwfAGZ/vMEhc42dSaWMTsN07qp0So3wanL
            tcRsDyOCiRX84tF1DPC9BKMVwJZ/em7fizysIQjmp/IASfM4XJIUPfmHd9KxGDO3
            lyoULUm3FxsGZzxI+6hzk9gEC7WSuZzze9Xz+NUT49pmpiw9u/Jq9B8WHGMWelM3
            O3vM
            -----END CERTIFICATE-----
        EOT
      + ca_key_algorithm      = (known after apply)
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + ready_for_renewal     = false
      + set_subject_key_id    = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_private_key.client["havardandersen"] will be created
  + resource "tls_private_key" "client" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @howieandersen |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/hub` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/hub.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_hub.tfstate.tfplan`